backend/app/Controllers/Products.php

    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();
---
SELECT *
FROM `products`

    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->find(['id' => $id]);
---
SELECT *
FROM `products`
WHERE `products`.`id` IN ('1')

    public function create()
    {
        helper(['form']);
        $rules = [
            'title' => 'required',
            'price' => 'required'
        ];
        $data = [
            'title' => $this->request->getVar('title'),
            'price' => $this->request->getVar('price'),
        ];
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $model = new ProductModel();
        $model->save($data);
---
INSERT INTO `products` (`title`, `price`) VALUES ('Product 2', 876)

    public function update($id = null)
    {
        helper(['form']);
        $rules = [
            'title' => 'required',
            'price' => 'required'
        ];
        $data = [
            'title' => $this->request->getVar('title'),
            'price' => $this->request->getVar('price'),
        ];
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $model = new ProductModel();
        $findById = $model->find(['id' => $id]);
        if(!$findById) return $this->failNotFound('No Data Found');
        $model->update($id, $data);
---
SELECT *
FROM `products`
WHERE `products`.`id` IN ('2')
UPDATE `products` SET `title` = 'Product Updated', `price` = 123
WHERE `products`.`id` IN ('1')

    public function delete($id = null)
    {
        $model = new ProductModel();
        $findById = $model->find(['id' => $id]);
        if(!$findById) return $this->failNotFound('No Data Found');
        $model->delete($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` IN ('1')
DELETE FROM `products`
WHERE `id` IN ('1')